{
 "URL": "https://timesofindia.indiatimes.com/topic/Aadhaar-card",
 "Webcontent": " You must login to keep earning daily check-in points  Lifetime Expired Redeemed Total redeemable TimesPoints * TimesPoints expire in 1 year from the day of credit  Fri, May 07, 2021 | Updated 10.48AM IST  LAST UPDATED : May 06, 2021, 06:10 AM IST    The state transport department has told all the permit holders of autorickshaws to ensure that their Aadhaar is linked to their bank account numbers to get Rs 1,500 per month under a state relief scheme.  The Supreme Court Friday asked the Centre to frame a national policy on admission of patients in hospitals after it was apprised that some of them in the NCR are seeking local address proof for admitting COVID-19 infected people. A bench headed by justice D Y Chandrachud was hearing the suo motu case on COVID-19 management in the country.   Vaccination of all individuals aged above 18 years is set to start from May 1 onwards in the entire country. Hundreds of people have been lining up at a gurdwara in Indirapuram since Thursday night because it has been offering what many hospitals are struggling with Oxygen.  A day after police busted a racket of black-marketing of Remdesivir in the city, the health department on Monday made it mandatory for buyers to show Aadhaar card and doctors prescription to buy the over the counter drug to prevent hoarding.     Though rules say vaccine-seeking citizens can show any document from the list of approved identity cards, many hospitals refuse to accept the passport or voter ID and demand Aadhaar. They say uploading details from documents other than Aadhaar on the Co-Win portal is laborious and time-consuming. The Uttar Pradesh government has ordered blacklisting of Aadhaar card centres found involved in malpractices. The move has been taken to after they received complaints that some centres are demanding bribes in lieu of making Aadhaar cards.   The Centre on Wednesday extended the deadline for linking of Aadhaar number with the permanent account number (PAN) by three months. In a tweet, the income tax department informed that the last date has been extended from March 31 to June 30, 2021. The decision has been taken after many people reported technical glitches on the income tax website while linking Aadhaar and PAN. The government has made linking of PAN (permanent account number) with Aadhaar mandatory and advised people not to miss the stipulated deadline of March 31, 2021. PAN will become inoperative if it is not linked with Aadhaar by this date.  TOI traced some of the people whose ration cards were cancelled or who could never get one made due to issues with Aadhaar to see where problem was and what's being done about it In an ironic twist of events, former chief election commissioner S Y Quraishi was not allowed to cast his vote in India International Centre (IIC) elections on Sunday as he did not have the smart identity card issued by the elite club. Even though Quraishi said he offered his Aadhaar card the IIC election officers are said to have insisted on the smart ID card.  RGI Airport police have recently arrested an Afghanistan national for carrying a fake Aadhaar card. Like many of the magnificent British-era buildings, the iconic General Post Office of Mumbai is a riot of turrets, big and small spires, minarets, big and small windows which allow light and air inside, topped off by a majestic dome looking at the early-summer clear blue skies. The Supreme Court on Wednesday asked the Centre to respond to allegations in a PIL that nearly three crore ration cards across states were cancelled because of non-seeding with Aadhaar and claimed that it was leading to starvation deaths in many states. The Supreme Court on Wednesday termed the cancellation of around three crore ration cards by the Centre due to non-linking with Aadhaar card as too serious, and sought response from the Central government and all states on the issue. The Supreme Court on Wednesday termed the cancellation of around three crore ration cards by the Centre due to non-linking with Aadhaar card as too serious, and sought response from the Central government and all states on the issue.    Co-Win as well as other IT applications and platforms will go live from Monday morning around 10 am. People will be required to just fill in a few details and upload the identification proof and publish. It is a matter of a few minutes and can be done on the same day, a senior official told TOI.  The Centre is contemplating linking the mobile numbers of general public with their 12-digit Aadhaar card numbers across the nation soon. This is primarily to help administer the second dose of Covid-19 vaccine. The decision by the Union government to link Aadhaar cards with driving licence and registration certificates (RC) of vehicles will bring down the number of visitors to various RTOs and also free them of agents/touts. A couple from West Bengali recently shared the images of the wedding menu designed like an Aadhaar Card. The images have been doing rounds on social media. In place of the Aadhaar number, the digits read the wedding date of the couple, which was 1st February 2021. A Kolkata's Rajarhat area's couple Gogol Saha and Subarna Das who are marketing and healthcare professionals the duo got married recently designed their food menu at their wedding as an Aadhar Card, pictures went viral City crime branch arrested an operator working at an Aadhaar centre and an agent for allegedly preparing Aadhaar cards using fake documents as well without documents In what could be a case of serious official lapse, more than 300 out-for-delivery Aadhaar cards were found abandoned by a scrap dealer among a pile of old paper at his shop in Kattakkada, on the outskirts of the state capital. Kattakkada police on Saturday registered a case and launched a probe to find out the circumstances in which the cards reached the scrap dealer. If a Covid-19 vaccine seeker provides his/her Aadhaar as identity proof to be inoculated, the government will immediately generate a unique health identity (UHID) for the individual. Eyeing this as an opportunity, authorities now are planning to use the vaccination programme to get digital health IDs for citizens. Once a UHID is generated, a persons health records are digitally maintained in hospitals and become a part of government records. The cyber police on Tuesday claimed that it has busted a gang involved in forging Aadhaar and voter ID cards and arrested two people. Several computers, forged Aadhaar cards and some cash have been recovered from the duo, police said. The state government has embarked on its exercise of registering people for the Covid-19 vaccine, but survey teams do not accept Aadhaar card as proof of identity. There’s no city like New York in the world Explained: Why some hospitals lack the oxygen to keep patients alive When Delhi’s politics defeated Sanju Samson How Muslims voted in the state elections  Copyright © 2021 Bennett, Coleman &amp; Co. Ltd. All rights reserved. For reprint rights: Times Syndication Service Copyright © 2021 Bennett, Coleman &amp; Co. Ltd. All rights reserved.For reprint rights: Times Syndication Service"
}